eis-cart-tests-master@3bc714a7387/tests/test-data/intf-specs/gswf/template/EIS_ResearchReportWrapper/request.xmlt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:even="http://www.thegoldensource.com/EventRaiserService.wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <even:RaiseEIS_ResearchReportWrapperAsynchron>
         <even:BRSPropertyFileLocation>db://resource/propertyfiles/UATBRSCredentials.enc</even:BRSPropertyFileLocation>
         <even:BRSWebserviceURL>${BRS_WEBSERVICE_URL}</even:BRSWebserviceURL>
         <even:EmailPropertyFileLocation>db://resource/propertyfiles/EmailHKCredentials.enc</even:EmailPropertyFileLocation>
         <even:EmailSubject></even:EmailSubject>
         <even:MessageType>EITW_MT_RESEARCH_REPORT</even:MessageType>
      </even:RaiseEIS_ResearchReportWrapperAsynchron>
   </soapenv:Body>
</soapenv:Envelope>